cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "cliclick"
brew "curl"
brew "git"
brew "shellcheck"
brew "tree"
brew "watch"
brew "wget"
brew "colordiff"
brew "awscli"
brew "mkcert"
brew "neovim"
brew "libpq"
brew "hadolint"
brew "goodwithtech/r/dockle"
brew "aquasecurity/trivy/trivy"
brew "peco"

cask "alfred"
cask "bettertouchtool"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "notion"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "postman"
cask "tableplus"
cask "karabiner-elements"
cask "1password"
cask "popclip"
cask "arctype"
cask "pomatez"
