cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "shivammathur/php"

brew "curl"
brew "git"
brew "shellcheck"
brew "tree"
brew "watch"
brew "wget"
brew "colordiff"
brew "awscli"
brew "mkcert"
brew "libpq"
brew "hadolint"
brew "goodwithtech/r/dockle"
brew "aquasecurity/trivy/trivy"
brew "peco"
brew "mas"
brew "graphviz"
brew "fujiwara/tap/tracer"
brew "jq"
brew "pre-commit"
brew "aquaproj/aqua/aqua"
brew "volta"
brew "direnv"
brew "shivammathur/php/php@7.4", link: true

cask "alfred"
cask "slack"
cask "docker"
cask "google-japanese-ime"
cask "iterm2"
cask "visual-studio-code"
cask "zoom"
cask "postman"
cask "karabiner-elements"
cask "1password"
cask "tableplus"
cask "adoptopenjdk"
cask "google-chrome"
cask "notion"
cask "fig"
cask "sidenotes"
cask "spotify"
cask "raindropio"
cask "dropbox"

mas "Flow - Focus & Pomodoro Timer", id:1423210932
mas "Yoink", id:457622435
mas "Toggl Track: Hours & Time Log", id:1291898086
