cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"

brew "cliclick"
brew "curl"
brew "git"
brew "shellcheck"
brew "tree"
brew "watch"
brew "wget"
brew "colordiff"
brew "awscli"
brew "mkcert"
brew "neovim"
brew "libpq"
brew "hadolint"
brew "goodwithtech/r/dockle"
brew "aquasecurity/trivy/trivy"
brew "peco"
brew "mas"
brew "graphviz"
brew "nvm"
brew "kayac/tap/ecspresso"

cask "alfred"
cask "bettertouchtool"
cask "docker"
cask "google-japanese-ime"
cask "iterm2"
cask "visual-studio-code"
cask "zoom"
cask "postman"
cask "karabiner-elements"
cask "1password"
cask "popclip"
cask "pushplaylabs-sidekick"
cask "tableplus"
cask "adoptopenjdk"
cask "alt-tab"

cask "logi-options-plus"

mas "Flow - Focus & Pomodoro Timer", id:1423210932
mas "LINE", id:539883307
